# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день
# выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

print('Введите номер дня недели: ')
num_day = input()
if num_day == '1':
    print('this day is not a day off')
elif num_day == '2':
    print('this day is not a day off')
elif num_day == '3':
    print('this day is not a day off')
elif num_day == '4':
    print('this day is not a day off')
elif num_day == '5':
    print('this day is not a day off')
elif num_day == '6':
    print('this day is a day off')
elif num_day == '7':
    print('this day is a day off')