# Вычислить число Пи c заданной точностью d
# *Пример:*
# - при d = 0.001, π = 3.141
# - при d = 0.0001, π = 3.1415

from math import pi


print(pi)
d = input("Введите пример количества  знаков после запятой числа Пи (0,0001): ")
d = d[2:len(d)]
print(round(pi, len(d)))



