# Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# Пример:
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

values = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
user_val = input('Введите искомую строку: ')


def search_val(val: list, a: str):
    desired_value = [i for i in range(len(val)) if val[i] == a]
    if len(desired_value) > 1:
        return f'Список: {val}, ищем: "{a}", ответ: {desired_value[1]}'
    else:
        return '-1'


print(search_val(values, user_val))


